Replace ASCI diagrams with Mermaid and SVG digrams
